## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger`           |
|        | `aws_lambda_function.api_end_to_end_test`                                  |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "api_end_to_end_test_lambda_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "api-end-to-end-test-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.api_end_to_end_test will be created
  + resource "aws_lambda_function" "api_end_to_end_test" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "api-end-to-end-test"
      + id                             = (known after apply)
      + image_uri                      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/api-end-to-end-test-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_PRIVATE_KEY"        = (sensitive value)
              + "API_URL"                = "http://forms-api.ecs.local:3001"
              + "FORM_ID"                = "cmacogetu00gsx001xt7sodoq"
              + "IDP_PROJECT_IDENTIFIER" = "284778202772022819"
              + "IDP_TRUSTED_DOMAIN"     = "auth.forms-formulaires.alpha.canada.ca"
              + "IDP_URL"                = "https://zitadel.ecs.local:8080"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/API_End_To_End_Test"
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0c5bcb63faaa940f1",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_api_end_to_end_test_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "api-end-to-end-test"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:ca-central-1:957818836222:rule/api-end-to-end-test-lambda-trigger"
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN -...
```

</details>
